Repository: Toddless/Last-Breath
Catalog: src/Last Breath/Localization/*.po
Languages: ru

source: Damage
ru: Урон

source: Health
ru: Здоровье

# CriticalChance
source: Critical Hit Chance
ru: Шанс критического удара

# MaxCriticalChance
source: Max. Critical Hit Chance
ru: Макс. шанс критического удара

# CriticalDamage
source: Critical Damage Multiplier
ru: Критический урон

source: Additional Hit Chance
ru: Шанс дополнительного удара

source: Max. Additional Hit Chance
ru: Макс. шанс дополнительного удара

source: Current Health
ru: Текущее здоровье

source: Max. Health
ru: Макс. здоровье

source: Dexterity
ru: Ловкость

source: Strength
ru: Сила

source: Intelligence
ru: Интеллект

source: Armor
ru: Броня

source: Evade
ru: Уклонение

source: Energy Barrier
ru: Энергетический барьер

source: Spell Damage
ru: Урон от заклинаний

# ResourceMax
source: Max. Resource
ru: Макс. ресурс

source: Resource Recovery
ru: Восстановление ресурса

# MaxReduceDamage
source: Max. Damage Reduction
ru: Макс. снижение урона

source: Movespeed
ru: Скорость передвижения

source: Max. Evade Chance
ru: Макс. шанс уклонения

source: Suppress
ru: Подавление

# AllAttribute
source: All Attributes
ru: Все атрибуты

# Flat
source: to
ru: Фиксированный

# Increase
source: Increased
ru: Увеличение

# Multiplicative
source: More
ru: Множитель

source: Extra Health
ru: Дополнительное здоровье

source: Extra Armor
ru: Дополнительная броня

source: Extra Energy Barrier
ru: Дополнительный энергетический барьер

source: Extra Evade
ru: Дополнительное уклонение

source: Extra Damage
ru: Дополнительный урон

source: Extra Suppress
ru: Дополнительное подавление

source: Extra Spell Damage
ru: Дополнительный урон способностей
