namespace Playground.Script.QuestSystem
{
    using Godot;

    public partial class QuestCompletion : Resource
    {
        // возможно нужно сохранять условия получения квеста
        // у какого нпс, какие условия
        // как квест завершен. Айди нпс, айди последнего диалога?
        // пример квест Дигри: Вернули список гному. Вернули список старейшине. Вернули список гному и потребовали доп награду.
        // Получили задание от старейшины, вернули список старейшине. Вернули список Дигри. 
        // 
    }
}
