{
    "Dialogs": [
        {
            "Id": "Awaking",
            "Texts": [
                {
                    "NpcText": "Незнакомый голос: Восстань!"
                },
                {
                    "NpcText": "Восстань? Куда, зачем? В Рай? Ад? Пока непонятно. Ощущения такие же, как и при жизни. Хотя нет, погодите-ка, что-то не так."
                },
                {
                    "NpcText": "Что это за странное чувство? Оно кричит, требует внимания, кажется таким знакомым..."
                },
                {
                    "NpcText": "Так стоп, а разве дух, мертвец или что я там сейчас должен испытывать подобные ощущения?"
                },
                {
                    "NpcText": "Почему я дух или мертвец? Ну это же очевидно. Я очень хорошо это помню. Я умер."
                }
            ],
            "Options": [
                {
                    "OptionName": "Вспомнить свою смерть.",
                    "TargetNode": "DeathMemory"
                },
                {
                    "OptionName": "Прислушаться к ощущениям",
                    "TargetNode": "ListenToTheFeelings"
                }
            ]
        },
        {
            "Id": "DeathMemory",
            "Texts": [
                {
                    "NpcText": "Мы тогда защищали город от наступающей нежити. Бои длились уже несколько дней, нас все сильнее и сильнее теснили, времени на отдых было очень мало. Многие валились с ног от усталости, руки едва удерживали оружие, пальцы так и норовили разжаться, но сдаться сейчас означало обречь на гибель всех жителей. Умереть же означало рано или поздно пополнить ряды противника."
                },
                {
                    "NpcText": "Но только если твое бренное тело останется лежать на поле боя. После схватки, во времена редкого затишья, все старались вытащить как можно больше павших товарищей с поля. Никто не обращал внимания на фракцию, был ли погибший другом или соперником. Главное ослабить противника, не позволить проклятию пополнить ряды нежити бывшими товарищами. Побороть проклятие можно многими способами. Гномы сжигают трупы, люди хоронят их на освященной земле. У эльфов тоже был какой-то свой особый ритуал, но о нем, за исключением самих эльфов, знали немногие, а те, кто знали, не распространялись об этом. Заслужить доверие эльфа крайне сложно, а потерять невероятно легко."
                },
                {
                    "NpcText": "Это был уже восьмой или девятый день битвы. Нас прижали к стенам, усталость достигла своего пика. Попытавшись заблокировать очередной удар, моя рука дрогнула, пальцы на долю мгновения разжались и меч был выбит из рук."
                },
                {
                    "NpcText": "Сердце пропустило удар. Страх поднялся откуда-то из глубин живота и холодным комом подступил к горлу. Я понял, что это конец. Времени что-то сделать у меня попросту не было. Всё, что мне оставалось, — это смотреть на приближающееся лезвие ржавого меча."
                },
                {
                    "NpcText": "А затем я ощутил. Его величество Удар. Именно так, с большой буквы. От обычных ударов его отличало то, что он был нанесен нежитью. А нежить сильна, чудовищно. В следующее мгновение я ощутил, как сминается доспех, разрывается плоть, дробятся и ломаются кости. Красная пелена закрыла взор. Боль была адской, она поглотила все. Не осталось ничего кроме боли. А затем пришла она, тьма…"
                }
            ],
            "ReturnToPrevious": true
        },
        {
            "Id": "ListenToTheFeelings",
            "Texts": [
                {
                    "NpcText": "Блять, да что же за чувство. Хотя, очень похоже на то, что я испытал за мгновение до смерти. Не такое всепоглощающее, но ужасно настойчивое. Ба, да это же моя старая знакомая боль."
                },
                {
                    "NpcText": "Так ладно, я мыслю. Значит ли это, что я снова существую? Если да, то почему? Неужели я был поднят проклятием? Или стал жертвой какого-то нерадивого некроманта?"
                },
                {
                    "NpcText": "Да вроде бы нет. Насколько я помню поднятые кадавры зачастую не отличались умом и сообразительностью. А я вот тут разлегся, философствую."
                },
                {
                    "NpcText": "Откуда я узнал, что лежу? Ну все просто, голова, спина и задница начинают замерзать, значит я нахожусь в горизонтальном положении, следовательно я лежу."
                },
                {
                    "NpcText": "Хм, я чувствую части тела. Может попробовать пошевелить чем-то? "
                }
            ],
            "Options": [
                {
                    "OptionName": "Попробовать пошевелиться",
                    "TargetNode": "TryToMove"
                }
            ]
        },
        {
            "Id": "TryToMove",
            "Texts": [
                {
                    "NpcText": "Ну, хуже, чем смерть уже ничего быть не может. Та-ак, ладно. Начнем с малого. Давай мизинец, ты справишься."
                },
                {
                    "NpcText": "Палец послушно согнулся, передал эстафету безымянному пальцу, а в затем и всей кисти. Как странно, рука слушается без каких-либо проблем. И не только рука, но и плечо. Хотя почему я удивляюсь, я уже довольно давно хорошо чувствую свое тело. Особенно эту ебучую боль под правой лопаткой. Пожалуй, хватит это терпеть."
                }
            ],
            "Options": [
                {
                    "OptionName": "Попытаться сесть",
                    "TargetNode": "TryToSitDown"
                },
                {
                    "OptionName": "Осмотреть тело",
                    "TargetNode": "InspectBody"
                }
            ]
        },
        {
            "Id": "InspectBody",
            "Texts": [
                {
                    "NpcText": "На первый взгляд ничего особенного. Кожа выглядит здоровой, привычного мне цвета. Торчащих костей или свисающих кусков мяса нигде не видать. Сердце привычно стучит в груди. В целом я не похож на типичного мертвеца. Хотя погодите, что-то все-таки не так. Я присмотрелся внимательнее к своей правой руке. Маленькая деталь не давала мне покоя. И через мгновение меня осенило. Шрам. Шрам, полученный в детстве, между большим и указательным пальцем. Его больше нет. Я опустил взгляд на грудь, туда, где я ожидал увидеть отметины от чудовищного удара, оборвавшего мою жизнь. Но… Ничего. Ну то есть мышцы, кости, кожа все на месте, но никаких шрамов. "
                }
            ],
            "ReturnToPrevious": true,
            "Quests": [
                {
                    "QuestId": "Main_Awaking_Part1"
                }
            ]
        },
        {
            "Id": "TryToSitDown",
            "Texts": [
                {
                    "NpcText": "Я сел и осмотрелся. (… описание места пробуждения …)."
                }
            ],
            "Options": [
                {
                    "OptionName": "Осмотреть место пробуждения",
                    "TargetNode": "Inspect"
                }
            ]
        },
        {
            "Id": "Inspect",
            "Texts": [
                {
                    "NpcText": "Первым делом я решил найти что же все это время так нещадно в меня впивалось. Бросив взгляд на мое лежбище я заметил предмет крайне необычной формы."
                }
            ],
            "Options": [
                {
                    "OptionName": "Подобрать предмет",
                    "TargetNode": "PickUpItem"
                }
            ]
        },
        {
            "Id": "PickUpItem",
            "Texts": [
                {
                    "NpcText": "Выглядит крайне необычно, но я не чувствую какой-либо магии. Ну учитывая, что «…» практически ничего не весит и очень мал по размеру, оставлю себе как талисман"
                }
            ],
            "Options": [
                {
                    "OptionName": "Оценить обстановку",
                    "TargetNode": "EvaluateSituation"
                }
            ]
        },
        {
            "Id": "EvaluateSituation",
            "Texts": [
                {
                    "NpcText": "Что ж, не густо. Однако не без хороших новостей. "
                }
            ],
            "Options": [
                {
                    "OptionName": "Хорошие новости",
                    "TargetNode": "GoodNews"
                },
                {
                    "OptionName": "Плохие новости",
                    "TargetNode": "BadNews"
                },
                {
                    "OptionName": "Что имеем",
                    "TargetNode": "Conclusions"
                }
            ]
        },
        {
            "Id": "GoodNews",
            "Texts": [
                {
                    "NpcText": "Хорошее – я, судя по всему, жив. Как? Отчего? Почему? Без малейшего понятия, очень хочется узнать, но спросить не у кого, да и задавать подобные вопросы чревато последствиями. Стоит держать в уме что в стране зверствует проклятие, поднимающее мертвецов. И хоть я и не похож на мертвеца, но факт того, что я умер, или умирал, остается фактом. "
                }
            ],
            "ReturnToPrevious": true
        },
        {
            "Id": "BadNews",
            "Texts": [
                {
                    "NpcText": "Плохое – я гол буквально как сокол. Меня обобрали до трусов. Ладно, не страшно. Вещи дело наживное, все будет со временем."
                },
                {
                    "NpcText": "Следующий пункт – я не имею ни малейшего понятия, где нахожусь. Да, деревья, растения и вроде бы небо похожи на Мирейн. Значит будем придерживаться того факта, что я все еще в своем родном мире."
                }
            ],
            "ReturnToPrevious": true
        },
        {
            "Id": "Conclusions",
            "Texts": [
                {
                    "NpcText": "И так, что мы имеем. 1. Я жив. 2. Я вроде бы в своем родном мире, но мне неизвестно где я нахожусь. 3. Я гол, беден и голоден. "
                },
                {
                    "NpcText": "Основная задача: Выяснить что со мной произошло. Помимо этого, мне нужно найти еду, одежду и подзаработать. Так же было бы неплохо сразиться с кем то, что бы понять, насколько все плохо с моими боевыми навыками."
                }
            ],
            "Options": [
                {
                    "OptionName": "End"
                }
            ],
            "Quests": [
                {
                    "QuestId": "Side_Battle_Skills"
                },
                {
                    "QuestId": "Side_First_Equip"
                },
                {
                    "QuestId": "Side_Who_Am_I"
                },
                {
                    "QuestId": "Side_I_Need_Food"
                }
            ]
        }
    ]
}